src/cf/Catalogs/БлокиНавигации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>БлокиНавигации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьРеестры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АлгоритмыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВспомогательнаяКоманда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомандыВиджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКомандаПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомандыВиджетов</v8:Type>
								<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкрытьВЕще</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/БлокиНавигации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
	МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Строка") Тогда
		ЗаполнитьНаОснованииПоставляемыхДанных(ДанныеЗаполнения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) И ЗначениеЗаполнено(Заголовок) Тогда
		Наименование = Заголовок;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если Не НаименованиеУникально() Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				Ошибки,
				"Объект.Наименование",
				НСтр("ru = 'Данное наименование уже указано для другого блока навигации.'"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет объект на основании поставляемых данных.
Процедура ЗаполнитьНаОснованииПоставляемыхДанных(БлокНавигации)
	
	ДанныеБлокаНавигации = Справочники.БлокиНавигации.ДанныеБлокаНавигации(БлокНавигации);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеБлокаНавигации, "Заголовок, Подсказка, Условие");
	
	Команды.Очистить();
	Для Каждого КомандаБлока Из ДанныеБлокаНавигации.КомандыБлока Цикл
		НоваяСтрока = Команды.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КомандаБлока, "ОсновнаяКоманда, ВспомогательнаяКоманда");
		НоваяСтрока.СкрытьВЕще = Ложь;
	КонецЦикла;
	
	Команды.Очистить();
	Для Каждого КомандаЕщеБлока Из ДанныеБлокаНавигации.КомандыЕщеБлока Цикл
		НоваяСтрока = Команды.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КомандаЕщеБлока, "ОсновнаяКоманда, ВспомогательнаяКоманда");
		НоваяСтрока.СкрытьВЕще = Истина;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, что наименование уникально.
// 
// Возвращаемое значение:
//  Булево - Наименование уникально.
//
Функция НаименованиеУникально()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БлокиНавигации.Ссылка
		|ИЗ
		|	Справочник.БлокиНавигации КАК БлокиНавигации
		|ГДЕ
		|	БлокиНавигации.Наименование = &Наименование
		|	И БлокиНавигации.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	НаименованиеУникально = РезультатЗапроса.Пустой();
	
	Возврат НаименованиеУникально;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
